# read design 
read_verilog sumador4.v

# elaborate design hierarchy
hierarchy -check -top sumador4

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cmos_cells.lib
dfflibmap -liberty cmos_cells.lib

# mapping logic to cmos_cells.lib
abc -liberty cmos_cells.lib

#Generate GraphViz output
show -format pdf -prefix sumador4_synth

# cleanup
clean

# write synthesized design
write_verilog sumador4_synth.v
